%建立小行星的三轴椭球模型，1/a^2 + 1/b^2 + 1/c^2 = 1;
%本函数输入量为三个轴的半长轴长a15km,7km,c6km,输出为球谐系数C20,C22
%主m文件，主要用来初始化一些参数，调用一些函数，厘清一些思路
%首先算出球谐系数c20和c22,下面是三个惯性轴方向的半轴长度
a = 15000;
b = 7000;
c = 6000;
[c20,c22] = SphericalHaromic(15,7,6);

%假定小行星的密度是均匀的，设定为3g/cm^3 = 3000千克每立方米
dens = 3000;

%算一下小行星的质量(kg)
M = (4/3)*pi*a*b*c*dens;
%算一下引力常数u = G*M G取G=6.67259e-11;
G = 6.67259e-11;
u = G*M;

%绘制小行星的xy平面
% x = -20000:1000:20000;
% y = -10000:1000:10000;
% [X,Y] = meshgrid(x,y);
% figure;
% surf(X,Y,X+Y);


%引力势






