function  dX  = DynamicEq02(t,X)
%DynamicEq 探测器动力学方程，x(m)为小天体旋转坐标系下的状态，t为时间（占位）
%当前函数主要算未施加控制的动力学

% x轴指向反向太阳的方向，z轴与小天体绕太阳旋转的角速度方向一致，y轴与x轴z轴
% 构成右手坐标系

% NorBeta 为标准化的太阳辐射加速度,此处取33.6
% Tu 为标准化的时间单位 Tu = 1/n = 6.5 * 10^6 s
% Lu 为标准化的距离单位 Lu = (u/n^2)^(1/3) = 1.1 * 10^5 m

NorBeta = 33.6;
% Tu = 6.5 * 10^5;
% Lu = 1.1 * 10^5;


%dX的1到3行对应x的4到6行，就是位置的一阶导对应速度
% V = X(4:6);
x = X(1);
y = X(2);
z = X(3);
dx = X(4);
dy = X(5);
dz = X(6);

% r表示探测器与小天体中心的距离
r = (x^2 + y^2 + z^2)^(1/2);

d2x = 2*dy - x/r^3 + 3*x + NorBeta;
d2y = -2*dx - y/r^3;
d2z = -z/r^3 - z;

dX = [dx dy dz d2x d2y d2z]';

end


