% 最后一次测试，修正引力势函数的缺陷，前面使用的一直是球形的引力势函数
% 所以造成较大误差，需要修改

clear;clc;

c20 = -0.0898;
c22 = 0.0391;


mu = 4/3*pi*15*7*6*6.67*0.01*3000;

%这里先设小天体引力为u/r 小天体的自转角速度为10h一圈w = 2*pi/10/3600 = 1.7453e-04 
%先求一下共振半径Rs = (mu/w^2)^(1/3) = 25884m;
w = 2*pi/10/3600;
Rs = (mu/w^2)^(1/3);


% 先从引力势函数开始求
syms  c20 c22 mu a phi lam r

% r = (x^2 + y^2 + z^2)^(1/2);
p20 = 1/2*( 3*sin(phi)^2 - 1 ); %连带勒让德函数计算
p22 = 3*(1 - sin(phi)^2);
V = mu/r*(1 + (a/r)^2  * (c20 * p20 + p22 * c22 * cos(2*lam))); % 引力势函数


dV_dr = diff(V,r,1);
% (mu*((a^2*(c20*((3*sin(phi)^2)/2 - 1/2) - c22*cos(2*lam)*(3*sin(phi)^2 - 3)))/r^2 + 1))/r^2 - (2*a^2*mu*(c20*((3*sin(phi)^2)/2 - 1/2) - c22*cos(2*lam)*(3*sin(phi)^2 - 3)))/r^4
% 开始求引力加速度即是[ dv/dx dv/dy dv/dz]

% syms x y z
% r = (x^2 + y^2 + z^2)^(1/2);
% dr_dx = diff(r,x,1);% x/(x^2 + y^2 + z^2)^(1/2)
% dr_dy = diff(r,y,1);% y/(x^2 + y^2 + z^2)^(1/2)
% dr_dz = diff(r,z,1);% z/(x^2 + y^2 + z^2)^(1/2)
% 
% dV_dx = diff(V,r,1)*dr_dx;
% dV_dy = diff(V,r,1)*dr_dy;
% dV_dz = diff(V,r,1)*dr_dz;


% 构造黑塞矩阵
syms  c20 c22 mu a  x y z;
dV_dx = (mu*((a^2*(c20*((3*z^2)/(2*(x^2 + y^2 + z^2)) - 1/2)...
    - (c22*((3*z^2)/(x^2 + y^2 + z^2) - 3)*(x^2 + y^2 - z^2))...
    /(x^2 + y^2 + z^2)))/(x^2 + y^2 + z^2) + 1))/(x^2 + y^2 + z^2)...
    - (2*a^2*mu*x*(c20*((3*z^2)/(2*(x^2 + y^2 + z^2)) - 1/2)...
    - (c22*((3*z^2)/(x^2 + y^2 + z^2) - 3)*(x^2 + y^2 - z^2))...
    /(x^2 + y^2 + z^2)))/(x^2 + y^2 + z^2)^(5/2);

   
dV_dy = (mu*((a^2*(c20*((3*z^2)/(2*(x^2 + y^2 + z^2)) - 1/2) ...
    - (c22*((3*z^2)/(x^2 + y^2 + z^2) - 3)*(x^2 + y^2 - z^2))...
    /(x^2 + y^2 + z^2)))/(x^2 + y^2 + z^2) + 1))/(x^2 + y^2 + z^2)...
    - (2*a^2*mu*y*(c20*((3*z^2)/(2*(x^2 + y^2 + z^2)) - 1/2) ...
    - (c22*((3*z^2)/(x^2 + y^2 + z^2) - 3)*(x^2 + y^2 - z^2))...
    /(x^2 + y^2 + z^2)))/(x^2 + y^2 + z^2)^(5/2);
    
    
dV_dz = (mu*((a^2*(c20*((3*z^2)/(2*(x^2 + y^2 + z^2)) - 1/2)...
    - (c22*((3*z^2)/(x^2 + y^2 + z^2) - 3)*(x^2 + y^2 - z^2))...
    /(x^2 + y^2 + z^2)))/(x^2 + y^2 + z^2) + 1))/(x^2 + y^2 + z^2)...
    - (2*a^2*mu*z*(c20*((3*z^2)/(2*(x^2 + y^2 + z^2)) - 1/2)...
    - (c22*((3*z^2)/(x^2 + y^2 + z^2) - 3)*(x^2 + y^2 - z^2))...
    /(x^2 + y^2 + z^2)))/(x^2 + y^2 + z^2)^(5/2);

NH11 = diff(dV_dx,x,1);
NH22 = diff(dV_dy,y,1);
NH33 = diff(dV_dz,z,1);
NH12 = diff(dV_dx,y,1);
NH13 = diff(dV_dz,x,1);
NH23 = diff(dV_dz,y,1);

% 先从引力势函数开始求
syms  c20 c22 mu a x y z
r = (x^2 + y^2 + z^2)^(1/2);
sp = (z/r)^2;
p20 = 1/2*( 3*sp- 1 ); %连带勒让德函数计算
p22 = 3*(1 - sp^2);
c2l = (x^2+y^2-z^2)/r^2;
V = mu/r*(1 + (a/r)^2  * (c20 * p20 + p22 * c22 * c2l)); % 引力势函数
h1 = diff(V,x,1);
h2 = diff(V,y,1);
h3 = diff(V,z,1);

Hes = hessian(V,[x,y,z]);


% 测试New_Hm函数
mu =  5.2826e+05;
pos_init = [13697,0,15530];
[d,v] = eig(New_Hm(13697,0,15530,mu));

vx = (mu*((a^2*(c20*((3*z^2)/(2*(x^2 + y^2 + z^2)) - 1/2)...
    - (c22*((3*z^2)/(x^2 + y^2 + z^2) - 3)*(x^2 + y^2 - z^2))...
    /(x^2 + y^2 + z^2)))/(x^2 + y^2 + z^2) + 1))/(x^2 + y^2 + z^2)...
    - (2*a^2*mu*x*(c20*((3*z^2)/(2*(x^2 + y^2 + z^2)) - 1/2)...
    - (c22*((3*z^2)/(x^2 + y^2 + z^2) - 3)*(x^2 + y^2 - z^2))...
    /(x^2 + y^2 + z^2)))/(x^2 + y^2 + z^2)^(5/2);